#+TITLE:     Doom Config
#+AUTHOR:    Alister Pillow
#+EMAIL:     alisterhp@mac.com
Time-stamp: <2020-02-14 08:07:45 alister>
**** Org Variable pitch v2
From https://zzamboni.org/post/beautifying-org-mode-in-emacs/
#+BEGIN_SRC emacs-lisp
;; (add-hook 'org-mode-hook 'variable-pitch-mode)
;; (add-hook 'org-mode-hook 'visual-line-mode)
#+END_SRC

#+RESULTS:
| visual-line-mode | (closure (t) (&rest _) (add-hook (quote before-save-hook) (quote org-encrypt-entries) nil t)) | er/add-org-mode-expansions | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | variable-pitch-mode | doom-disable-show-paren-mode-h | doom-disable-show-trailing-whitespace-h | +org-enable-auto-reformat-tables-h | +org-enable-auto-update-cookies-h | +org-unfold-to-2nd-level-or-point-h | evil-org-mode | org-bullets-mode | toc-org-enable | +evil-embrace-latex-mode-hook-h | embrace-org-mode-hook | org-journal-update-auto-mode-alist | org-eldoc-load |

